Tekla.Structures.ComponentOptions
The ComponentOptions class represents the component options.

Tekla.Structures.ComponentOptions.PlateProfileName
The plate profile name.
Remarks: The maximum length is 10 characters.

Tekla.Structures.ComponentOptions.FoldedPlateProfileName
The folded plate profile name.
Remarks: The maximum length is 10 characters.

Tekla.Structures.ComponentOptions.BoltEdgeDistanceFactor
The factor of bolt edge distance.

Tekla.Structures.ComponentOptions.BoltEdgeDistanceReference
The bolt edge distance reference.

Tekla.Structures.ComponentOptions.BoltStandard
The bolt standard.

Tekla.Structures.ComponentOptions.BoltSize
The bolt size.

Tekla.Structures.ComponentOptions.PartMaterial
The part material.

Tekla.Structures.ComponentOptions.PartWeldedToPrimaryStartNumber
The part welded to primary start number.

Tekla.Structures.ComponentOptions.PartWeldedToPrimaryPositionPrefix
The part welded to primary position prefix.

Tekla.Structures.ComponentOptions.PartWeldedToSecondaryStartNumber
The part welded to secondary start number.

Tekla.Structures.ComponentOptions.PartWeldedToSecondaryPositionPrefix
The part welded to secondary position prefix.

Tekla.Structures.ComponentOptions.LoosePartStartNumber
The loose part start number.

Tekla.Structures.ComponentOptions.LoosePartPositionPrefix
The loose part position prefix.

Tekla.Structures.ComponentOptions.AssemblyLoosePartStartNumber
The assembly loose part number.

Tekla.Structures.ComponentOptions.AssemblyLoosePartPositionPrefix
The assembly loose position prefix.